{"all": [{"username": "achingbrain", "name": "Alex Potsides", "title": "Guvnor: running your processes like a boss", "avatar": "https://avatars.githubusercontent.com/u/665810?v=3", "date": "April 22nd 2015", "desc": "<a href='https://www.npmjs.com/package/guvnor'>Guvnor</a> is a fully featured, multi user process manager for node.js/io.js that leans heavily on the Unix permissions model for security.  It's also got a neat web interface that monitors multiple hosts, reports live statistics about your application and lets you interact with it - debugging, monitoring resource usage, live logs, restarting, etc.<br><br>The talk will cover why the world needs another process manager, CLI usage, deploying apps from git repositories, cluster management, using the web interface and live coding a small app that uses the programmatic interface."}, {"username": "jamesallardice", "name": "James Allardice", "title": "Writing and publishing ES6 code today", "avatar": "https://avatars.githubusercontent.com/u/1089719?v=3", "date": "April 22nd 2015", "desc": "On February 20th the first release candidate of the 6th edition of the ECMAScript specification (ECMAScript 2015 as it is now officially known) was released. The language is rapidly stabilising and the new features are slowly but surely making their way into the existing JavaScript engines. Unfortunately, it will still be a while before we're able to write ES6 code and have it run natively in either browsers or Node and io.js. Thankfully TC39 (the group responsible for the development of the ECMAScript specification) put a lot of effort into ensuring backwards compatibility so it is possible to use a large and growing proportion of ES6 today.<br><br>This talk will look into some of the technologies and techniques that can be used to write, publish and deploy ES6 code today, without having to wait until the engines catch up. We'll explore source-to-source compilation, standard library polyfills, publishing modules written in ES6 to npm and the consumption of those modules by existing ES5 and new ES6 code."}, {"username": "simonmcmanus", "name": "Simon McManus", "title": "Progressive Enhancement Strategies", "avatar": "https://avatars.githubusercontent.com/u/55853?v=3", "date": "April 22nd 2015", "desc": "Advances in JavaScript are changing the way that we think about the web; it's no longer just a platform for information, but for complex interactions too.<br><br>As we race into the future, we risk losing some of the things that make the web so special.<br><br>In this talk I will outline why I believe progressive enhancement is still important. Demonstrating processes, techniques and architectures which provide the benefits without introducing an overhead. "}]}