{"all": [{"username": "hxoliverrumbelow", "name": "hxoliverrumbelow", "title": "Blowing out the LAMP", "avatar": "https://avatars.githubusercontent.com/u/3088374?v=3", "date": "June 24th 2015", "desc": "Holiday Extras, a times top 100 company, maintains a big online presence selling airport parking, travel insurance and overnight stays in hotels. We made over 4,000,000 bookings last year and our API serves around 35 requests/second - we aren't big big, but we're big enough to have to deal with 'big website' problems.<br><br>We've spent 3 years fully migrating our production traffic away from a 10 year old LAMP stack to a NodeJS API. I want to share our journey - the migration plan, the evolution of our NodeJS codebase from beginning to end, our biggest mistakes and our biggest victories."}, {"username": "mikemaccana", "name": "Mike MacCana", "title": "Deploying and running Node apps in 2015", "avatar": "https://avatars.githubusercontent.com/u/172594?v=3", "date": "June 24th 2015", "desc": "Everything you need to take advantage of npm in your browser side code, and avoid the pitfalls! <br><br>Including:<br><br> - Building browser bundles with gulp and npm build -  and how they compare<br> - How to identify the modules that contribute to bundle file size<br> - Pros, cons and workarounds for the izs style 'no lib dir, everything is a module' coding style<br> - Understanding nom versioning and ensuring consistent deploys<br> - How to include templates in your browserify bundles<br><br>Based on experiences in a real world, production, profitable application. "}, {"username": "maxwellito", "name": "maxwellito", "title": "Liwe, an open source remote control for WebApps", "avatar": "https://avatars.githubusercontent.com/u/1097232?v=3", "date": "June 24th 2015", "desc": "This is a project I've been working on for few months and I just released it on <a href='https://github.com/liwe'>github.com/liwe</a> (under MIT). It's a service to let web developers (frontend guys) to use smartphones as remote for their webapps. Of course it's built with NodeJS. But at the moment it look more like a prototype than a robust piece of code.<br><br>It won't be very techy, especially in front of NodeJS developers. The talk would be axed on two main points:<br><br>- Make a technology accessible to other developers. Like sockets (think about jQuery and PHP devs)<br>- Find contributors<br><br>I have absolutely no idea if this talk respect the idea of LNUG. I think I can hold 20 minutes demo included.<br><br>https://github.com/liwe<br>http://liwe.co"}]}