[
    {
        "apiSpeakerUrl": "https://api.github.com/users/alistairstead",
        "speakerUrl": "https://github.com/alistairstead",
        "title": "Full-stack BDD and its side effects",
        "description": "<p>This is not yet another how do you do BDD in JavaScript talk. This is a talk about how you can apply widespread software design practices such as Design Patterns, BDD, TDD, DDD and SOLID to full-stack development. Less how to use these practices, more how to select and use them effectively.&#13;&#10;&#13;&#10;Just using these tools on their own can lead to unnecessary complexity that can be hard to understand or avoid. So let&rsquo;s set aside discussions of the language syntax or capabilities and focus on what is important - delivering value to the customer.&#13;&#10;&#13;&#10;This presentation will show how BDD practices can be applied to the different contexts of developing features through a multi-layer stack whilst smoothing the communication, providing detailed direction and showing the value for business owners and developers alike. The result is a feature that meets the business owner&rsquo;s expectations with happy side effects such as the code being clean, well designed, understandable, fully tested and documented.</p>\n",
        "milestone": "October 28th 2015",
        "img": "https://avatars.githubusercontent.com/u/62936?v=3",
        "handle": "alistairstead",
        "name": "Alistair Stead"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/tomgco",
        "speakerUrl": "https://github.com/tomgco",
        "title": "White water streams",
        "description": "<p>We use streams on a daily basis when handling data with our Node.js applications, but how do they work, and more importantly, how do we keep them efficient and performant?&#13;&#10;&#13;&#10;This talk focus mainly on analysing applications that utilises streaming data, identifying bottlenecks and making improvements. Be wow&rsquo;ed by Flame{graphs,charts}, awed by benchmarks and take away some tips in writing decent stream implementations.</p>\n",
        "milestone": "October 28th 2015",
        "img": "https://avatars.githubusercontent.com/u/524382?v=3",
        "handle": "tomgco",
        "name": "Tom Gallacher"
    }
]
