[
    {
        "apiSpeakerUrl": "https://api.github.com/users/arismarko",
        "speakerUrl": "https://github.com/arismarko",
        "title": "How to develop a emergency website using Prisma2 ORM, NodeJS, NextJS and deploy it in heroku, and Zeit",
        "description": "<p>On those critical times, I took the chance to learn something new and tried to PRISMA 2, to create a small website, that shows where there are supplies [Bread, Pasta and ToiletRolls]. </p>\n<p>I will go through all the difficulties of developing the app as Prisma2 is still in development, and how to deploy the app in Heroku. </p>\n<p>For the frontend I used NextJS that connects to a nodejs API (very simple) that uses the Prisma client. </p>\n<p>Aris is a developer for a number of years in FullStack development and a servant of the London&#39;s community powering <a href=\"https://cityjsconf.org\">CityJS</a> and <a href=\"https://www.meetup.com/js-monthly/\">JSMonthly</a>. </p>\n",
        "milestone": "June 24th 2020",
        "img": "https://avatars0.githubusercontent.com/u/281849?v=4&s=40",
        "handle": "arismarko",
        "name": "Aris Markogiannakis"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/craigtaub",
        "speakerUrl": "https://github.com/craigtaub",
        "title": "Under-the-hood of web bundlers",
        "description": "<p>A look at the mechanisms inside web bundlers e.g Webpack.</p>\n<p>Starting with why they are still useful.</p>\n<p>Then how to build a small compiler, akin to Webpack. There are many interesting topics in a very small space here.</p>\n<p>Next how to use the output of our compiler with an application.</p>\n<p>Finishing with all the additional parts Webpack does which ours doesn&#39;t, hopefully with some idea on how those could be done.</p>\n<h2 id=\"about-me\">About me</h2>\n<p>I&#39;m a senior developer at Nested with over 10 years experience. We do dev team talks every week and I have taken a couple, usually on the &quot;under-the-hood of&quot; theme. I was previously at the BBC.</p>\n<p>My medium page is <a href=\"https://medium.com/@tabu_craig\">https://medium.com/@tabu_craig</a>, I enjoy blogging.</p>\n",
        "milestone": "June 24th 2020",
        "img": "https://avatars1.githubusercontent.com/u/3532787?v=4&s=40",
        "handle": "craigtaub",
        "name": "Craig Taub"
    }
]