[
    {
        "apiSpeakerUrl": "https://api.github.com/users/lazlojuly",
        "speakerUrl": "https://github.com/lazlojuly",
        "title": "Unit testing has never been so much fun!",
        "description": "<ul>\n<li>This is a lightweight and entertaining 15 minutes long talk.</li>\n<li>It is aimed at developers on <strong>ALL</strong> levels.</li>\n<li>Covers basic and advanced concepts.</li>\n</ul>\n<p>Bio: I am a JavaScript Engineer with growth mindset. &#10;Connect with me on <a href=\"https://twitter.com/lazlojuly\">Twitter</a>, <a href=\"https://www.linkedin.com/in/lazlojuly\">LinkedIn</a> or <a href=\"https://github.com/lazlojuly\">GitHub</a></p>\n",
        "milestone": "January 24th 2018",
        "img": "https://avatars0.githubusercontent.com/u/7015868?v=4",
        "handle": "lazlojuly",
        "name": "lazlojuly"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/xscheiner",
        "speakerUrl": "https://github.com/xscheiner",
        "title": "Moving on from Mongoose: How a great thing finally cornered us",
        "description": "<p>Mongoose has helped us greatly to maintain the integrity of our data against a mongodb database. However, we are not able to share the models we use on our apis anywhere outside those apis. And Mongoose schemas are not shareable, which means we cannot consume them on any other level of our applications. This means either using conversion plugins, or else writing and maintaining some other solution. In addition, the mongoose models themselves are not shareable, which means even if we solve the schema issue, we still have at least two sets of models to maintain.</p>\n<p>Finally, we use Typescript, which means ideally we can share schema definitions with that which would allow us to define our entities once and have those definitions propagate to all levels of our applications.</p>\n<p>The final part of this presentation will focus on the solution we now intend to adopt as we begin to overhaul our entire architecture in the coming months.</p>\n",
        "milestone": "January 24th 2018",
        "img": "https://avatars3.githubusercontent.com/u/1236507?v=4",
        "handle": "xscheiner",
        "name": "David Scheiner"
    }
]