[
    {
        "apiSpeakerUrl": "https://api.github.com/users/theninj4",
        "speakerUrl": "https://github.com/theninj4",
        "title": "Cultivating a Microservice Culture with Node.js",
        "description": "<p>We&#39;ve spent the last 14 months working with Node.js to migrate the Holiday Extras engineering team away from Node.js monolith applications and over to Node.js microservices. Node.js is the heart and soul of the operation and the time has come to share how it&#39;s taken us above and beyond our wildest dreams. In this talk I&#39;ll be sharing how we&#39;re using Node.js throughout our stack, some of the key projects we&#39;ve built and the problems they solve, and how to really make the most out of Node.js to build an incredibly powerful engineering experience. </p>\n<p>I&#39;m a software engineer in the tech-foundations pod at <a href=\"http://join.holidayextras.co.uk/\">Holiday Extras</a> with a remit to improve the efficiency of our engineering team. I&#39;ve been writing Node.js day-in-day-out for over 5 years and dabble with infrastructure on the side.</p>\n",
        "milestone": "February 28th 2018",
        "img": "https://avatars2.githubusercontent.com/u/3055120?v=4",
        "handle": "theninj4",
        "name": "Oliver Rumbelow"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/thanpolas",
        "speakerUrl": "https://github.com/thanpolas",
        "title": "Classical Inheritance in Javascript",
        "description": "<p>Javascript inheritance has always been a challenging issue for new and seasoned developers. In this talk, we will dive deep into the inner workings of Javascript inheritance and see the beauty of prototypical inheritance and the prototype chain. While this is a classic talk, it is particularly relevant to the current debate in the React community over the use of fat arrow vs pre-bounded methods.&#10;<a href=\"https://speakerdeck.com/thanpolas/classical-inheritance-in-javascript\">Talk slides</a></p>\n<p>Github: <a href=\"https://github.com/thanpolas\">thanpolas</a>, Twitter: <a href=\"https://twitter.com/thanpolas\">@thanpolas</a>, <a href=\"http://www.linkedin.com/in/thanpolas\">LinkedIn</a>, <a href=\"http://thanpol.as\">website</a></p>\n",
        "milestone": "February 28th 2018",
        "img": "https://avatars1.githubusercontent.com/u/458813?v=4",
        "handle": "thanpolas",
        "name": "Thanasis Polychronakis"
    }
]