[
    {
        "apiSpeakerUrl": "https://api.github.com/users/HugoDF",
        "speakerUrl": "https://github.com/HugoDF",
        "title": "Going cross-platform with React: ~1 codebase, 3 platforms",
        "description": "<p>What&#39;s the fastest way to ship a Web, iOS and Android app?&#13;&#10;&#13;&#10;React Native goes beyond making native apps with web technology. You use javascript (granted that&#39;s a web technology) to make a fully fledged React app, using native components.&#13;&#10;&#13;&#10;It&#39;s more than leveraging the power of the (state) =&gt; (UI) mapping of React. It&#39;s about code reuse. Being this DRY hurts. All the high-level logic is portable and you have <strong>one</strong> single codebase for all three target platforms. &#13;&#10;&#13;&#10;All of this is free, as long as you embrace React.</p>\n",
        "milestone": "January 27th 2016",
        "img": "https://avatars.githubusercontent.com/u/6459679?v=3",
        "handle": "HugoDF",
        "name": "Hugo"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/philnash",
        "speakerUrl": "https://github.com/philnash",
        "title": "2FA, WTF?",
        "description": "<p>Everyone is hacking everything. Everything is vulnerable. Your site, your users, even you. Are you worried about this? You should be!&#13;&#10;&#13;&#10;Don&#39;t worry, I&#39;m not trying to scare you (that much). We have plenty of safeguards against attempts on our applications&#39; user data. We all (hopefully) recognise Two Factor Auth as one of those safeguards, but what actually goes on under the hood of 2FA?&#13;&#10;&#13;&#10;We&#39;ll take a look into generating one time passwords in JavaScript, implementing 2FA in Node.js applications and the only real life compelling use case for QR codes. Together, we&#39;ll make the web a more secure place.</p>\n",
        "milestone": "January 27th 2016",
        "img": "https://avatars.githubusercontent.com/u/31462?v=3",
        "handle": "philnash",
        "name": "Phil Nash"
    },
    {
        "title": "Slot available",
        "description": "This slot is still available, help us out: <a href=\"/speak.html\">Submit a talk proposal</a>.",
        "img": "/images/favicon/favicon-128.png",
        "milestone": "January 27th 2016"
    }
]