[
    {
        "apiSpeakerUrl": "https://api.github.com/users/jamesporter",
        "speakerUrl": "https://github.com/jamesporter",
        "title": "Elm: your next programming language?",
        "description": "<p>Maybe you have heard of Elm, the functional, front-end web language. But why would you as a full stack or backend Javascript developer learn this? Actually, it is the perfect first functional programming language (way friendlier than the others) and could change the way you think about programming Javascript. In particular you will better understand how and why to use TypeScript or Flow.</p>\n<p>The talk comes in two parts. The first is a quick introduction to Elm via its REPL. We&rsquo;ll take a look at a few of its key features and lightweight syntax. In the second part we will experience one of Elm&rsquo;s superpowers: it makes making changes easy. We&#39;ll take an existing Elm App and add a new feature, letting the friendly compiler guide us to a working version.</p>\n<p>I&#39;m a polyglot developer currently focusing on React and React Native projects, but I dabble in lots other things. For example I recently made Isometrically: an App for creating 3D-ish graphics, ideal for websites thanks to SVG export/tiny file sizes: <a href=\"https://isometrically.amimetic.co.uk\">https://isometrically.amimetic.co.uk</a></p>\n<p>I&#39;m <a href=\"https://twitter.com/complexview\">@complexview</a> on Twitter.</p>\n",
        "milestone": "July 25th 2018",
        "img": "https://avatars1.githubusercontent.com/u/383353?v=4&s=40",
        "handle": "jamesporter",
        "name": "James Porter"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/sp3c1",
        "speakerUrl": "https://github.com/sp3c1",
        "title": "Scheduled Messaging with RMQ, Redis, Postgres",
        "description": "<p>It is kind of interesting how in 2018 we are missing a timed messaging queue system out of the box, and there is no clear standard how to handle the matter. We will showcase some valid use cases, discuss performance, engineering and architectural limitations, implementing and comparing RMQ, Redis and Postgres based solutions.</p>\n<p>Bartlomiej Specjalny, Senior Software Engineer at Bizzby Limited, a fullstack software engineer with background in computer graphics and multimedia.</p>\n",
        "milestone": "July 25th 2018",
        "img": "https://avatars0.githubusercontent.com/u/4508208?v=4&s=40",
        "handle": "sp3c1",
        "name": "sp3c1"
    }
]