[
    {
        "apiSpeakerUrl": "https://api.github.com/users/tschoffelen",
        "speakerUrl": "https://github.com/tschoffelen",
        "title": "Transactional emails at scale",
        "description": "<p>Almost all tech startups send out a bunch of emails to their users. Many of those will be based on certain triggers, like creating accounts, new posts, invoice creation, etc. Based on my experience building some companies and apps that rely heavily on transactional emails, I&#39;d like to talk about how to manage and structure those.</p>\n<ul>\n<li>Building and managing templates with involvement of stakeholders (marketing/partnerships team, designers, etc.)</li>\n<li>My solution: Macaw (<a href=\"https://github.com/macaw-email/macaw\">repo</a> | <a href=\"https://schof.co/macaw\">blog</a>) - a Node.js toolset to streamline email sending and template management</li>\n<li>Setting up an email sending flow in your serverless app</li>\n<li>(optional - depending on time) Ensuring your emails arrive: your own IP address, SPF and DKIM, reply-to, etc.</li>\n</ul>\n<h2 id=\"bio\">Bio</h2>\n<p>Starting my first tech company at age 16, I&#39;ve co-founded several startups that focus on improving communication and helping small businesses, including <a href=\"https://near.st\">NearSt</a>, which partners with Google to help local shops make their products searchable and <a href=\"https://infowijs.nl\">Infowijs</a>, which helps Dutch high schools communicate better with their students, parents and teachers.</p>\n<p>I&#39;m on Twitter as <a href=\"https://twitter.com/tschoffelen\">@tschoffelen</a>.</p>\n<hr>\n<p>I confirm my talk is 20 mins long in total.&#10;I confirm that I will abide by the Code of Conduct.</p>\n",
        "milestone": "March 25th 2020",
        "img": "https://avatars3.githubusercontent.com/u/666220?v=4&s=40",
        "handle": "tschoffelen",
        "name": "Thomas Schoffelen"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/bernardbaker",
        "speakerUrl": "https://github.com/bernardbaker",
        "title": "Authentication &amp;&amp; Serverless &amp;&amp; Node",
        "description": "<p>Auth0 is a leading world class authentification platform. And I&#39;d like to present it using Node and Serverless.</p>\n<p>Regular methods of authentication include setting up a custom authentification API, user, session and token management. Which is time consuming, not productive and plainly put, not very secure if a solution doesn&#39;t aspire to RFC specifications.</p>\n<p>In my talk I will present to the audience; Auth0 as a solution, Netlify serverless functions, a Node API implementation of passwordless authentication, and basic API endpoint protection using JWT.</p>\n<p>I&#39;m Bernard, I&#39;m working for myself. An e-commerce startup. <a href=\"https://twitter.com/bernibear2000\">@bernibear2000</a>.</p>\n",
        "milestone": "March 25th 2020",
        "img": "https://avatars2.githubusercontent.com/u/13556172?v=4&s=40",
        "handle": "bernardbaker",
        "name": "Bernard Baker"
    }
]