[
    {
        "apiSpeakerUrl": "https://api.github.com/users/artemave",
        "speakerUrl": "https://github.com/artemave",
        "title": "Fullstack integration testing that doesn&#39;t suck",
        "description": "<p>With the help of electron, it is now possible to run your entire web stack (SPA + backend) in a single process. When applied to testing, this becomes a compelling alternative to webdriver based testing, as it is much faster and easier to debug.</p>\n<p>In this talk, I am going to start with setting some base terminology of what types of tests there are in a typical web app, what they&#39;re for and then show off a <a href=\"https://github.com/featurist/full-stack-js-testing-demo\">real example</a>.</p>\n<p>My name is Artem Avetisyan. I work at <a href=\"http://www.featurist.co.uk/\">Featurist</a>. We&#39;re a small bunch of like minded individuals who believe that Javascript is the one. We&#39;re also very serious about testing and we like good tools. Oh, and we&#39;re hiring too.</p>\n",
        "milestone": "March 22nd 2017",
        "img": "https://avatars1.githubusercontent.com/u/23721?v=3",
        "handle": "artemave",
        "name": "artem avetisyan"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/tonyyates",
        "speakerUrl": "https://github.com/tonyyates",
        "title": "Our future is in little hands",
        "description": "<p>I am a huge advocate of women in technology, and I am active in the Health Tech Women movement. I think it is essential that we teach children both boys and girls the fundamentals of computing and engineering at an early age.</p>\n<p>I practice what I preach with my own daughter who hacked a chromebook at 3 years old. We also took some unique approaches to her homework which she has shared with school.&#10;Basically the aim of my talk is to encourage others to get involved with technology and their children at an early age, they love it more than gazing at iPads too.</p>\n<p>I wrote a <a href=\"http://www.tonyyates.co.uk/my-3-year-old-daughter-hacked-a-google-chromebook/ &quot;My 3 year old hacked a chromebook&quot;\">blog post</a> which shows one of the many projects we have create. We also done some using nodered, arduiono and shrimpkit which form the basis of my talk.</p>\n<p>About Me</p>\n<p>@TonyYates on Twitter&#10;I am currently lead technical architect for NHS.UK, Citizen ID, Personal Health Records, and NHS Public WIFI all these are going through a major transformation at the moment but that is another talk as we use nodejs heavily.</p>\n<p>Lover of most technologies (except Ruby, I don&#39;t know why), keen cyclist, dad to 3 children under 5 years old so I get little sleep.</p>\n",
        "milestone": "March 22nd 2017",
        "img": "https://avatars1.githubusercontent.com/u/769623?v=3",
        "handle": "tonyyates",
        "name": "Tony Yates"
    },
    {
        "title": "Slot available",
        "name": "Submit your talk!",
        "description": "This slot is still available, help us out: <a href=\"/speak.html\">Submit a talk proposal</a>.",
        "img": "/images/favicon/favicon-128.png",
        "speakerUrl": "/speak.html",
        "milestone": "March 22nd 2017"
    }
]