[
    {
        "apiSpeakerUrl": "https://api.github.com/users/dmagliola",
        "speakerUrl": "https://github.com/dmagliola",
        "title": "Harnessing the full power of Redis",
        "description": "<p>The vast majority of projects use Redis like it&#39;s Memcached, but Redis can give so much more. In this talk I&#39;ll give practical examples of use cases where Redis, with its very particular set of skills, outshines everything else I&#39;ve tried.&#13;&#10;&#13;&#10;Bio:&#13;&#10;Daniel Magliola has been writing code since he was 7 years old, professionally since 16, and through those years has dabbled in multiple technologies. These days you&#39;ll find him trying to extract every last bit of performance out of web applications.&#13;&#10;&#13;&#10;<a href=\"http://danielmagliola.com/\">Portfolio / Bio / CV / about me</a>&#13;&#10;&#13;&#10;Note on length: &#13;&#10;I <em>can</em> fly through this talk in 25 minutes, I can probably also shorten it a bit more and do it in 20 (with no time for Q&amp;A), but it&#39;s really a whirlwind. If I could have 30 or more that&#39;d make it a lot more understandable by the audience :-)&#13;&#10;&#13;&#10;Note on dates: &#13;&#10;I can do August, but not September unfortunately.</p>\n",
        "milestone": "August 24th 2016",
        "img": "https://avatars.githubusercontent.com/u/1516867?v=3",
        "handle": "dmagliola",
        "name": "Daniel Magliola"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/bernardbaker",
        "speakerUrl": "https://github.com/bernardbaker",
        "title": "NodeJS a professional case study",
        "description": "<p>Hiring people from these events work! And small NodeJS apps that get things done.&#13;&#10;&#13;&#10;When I came to a previous event I was asked if I was hiring... I was, and found a great candidate and now a new team member for our development team.&#13;&#10;&#13;&#10;She will describe her working day and the different things she has been doing with us at Sky Works since she started.&#13;&#10;&#13;&#10;After that I will take you through the build and development of a small NodeJS app which gets a single task done well. We use it to update obfuscated JavaScript files.&#13;&#10;&#13;&#10;I&#39;ll explain the project/technical/functional brief and then take you through the development in steps of progress, there will be live coding of parts of the application and an explanation of how the libraries used work.&#13;&#10;&#13;&#10;At the end I will present the live application which is hosted on Heroku.&#13;&#10;&#13;&#10;Twitter: @bernibear2000&#13;&#10;Github: bernardbaker</p>\n",
        "milestone": "August 24th 2016",
        "img": "https://avatars.githubusercontent.com/u/13556172?v=3",
        "handle": "bernardbaker",
        "name": "Bernard Baker"
    },
    {
        "title": "GUIDE DOGS",
        "name": "Submit your talk!",
        "description": "This slot is still available, help us out: <a href=\"/speak.html\">Submit a talk proposal</a>.",
        "img": "/images/favicon/favicon-128.png",
        "speakerUrl": "/speak.html",
        "milestone": "August 24th 2016"
    }
]