[
    {
        "apiSpeakerUrl": "https://api.github.com/users/flyingunicorn222",
        "speakerUrl": "https://github.com/flyingunicorn222",
        "title": "Trading cryptocurrencies, forex, commodities stocks and more using node.js",
        "description": "<p>Description: The aim of the talk is to show what i have learnt and the libraries and tools i have developed over the last couple years after getting into trading bitcoin and ethereum, which turned out later into trading all sorts of things based on technical analysis and a bit of flaky statistics. I&#39;m really bad at making graphs and charts and what not, so expect some hands on approach, the talk should cover the very basics of trading and then how to use trading APIs to actually buy and sell stuff online directly from your command line.</p>\n<p>About me: The first time i programmed javascript was twenty years ago and since them i have played around with pretty much all the interesting programming languages i have found in front of me just to discover in 2011 i would actually end up doing everything again using only node.js. During this long journey i have worked on backend and frontend applications, interactive games, multiplayer applications, and whatnot. The last few years my big interest turned to be blockchain, cryptocurrencies and trading. After moving to London nearly seven years ago i worked for a few years in a very nice design studio and then later left to create my own little technology company where all those crazy experiments happen.</p>\n",
        "milestone": "May 24th 2017",
        "img": "https://avatars0.githubusercontent.com/u/20960175?v=3",
        "handle": "flyingunicorn222",
        "name": null
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/paulbjensen",
        "speakerUrl": "https://github.com/paulbjensen",
        "title": "From LNUG presentation to published book - my tale of writing &quot;Cross Platform Desktop Applications&quot;",
        "description": "<p>3 years ago I gave a talk at LNUG on Node Webkit, and then posted online. Little did I know that the end result would be writing a book for Manning publications on Electron and NW.js.</p>\n<p>This talk is about how that happened, the process of writing a book about those Node.js frameworks, and the learnings from undertaking the whole project. </p>\n<p>My name is Paul Jensen, and I&#39;m a Senior Pre-Sales Consultant at Starcount. My Twitter handle is @paulbjensen.</p>\n",
        "milestone": "May 24th 2017",
        "img": "https://avatars0.githubusercontent.com/u/3840?v=3",
        "handle": "paulbjensen",
        "name": "Paul Jensen"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/willm",
        "speakerUrl": "https://github.com/willm",
        "title": "Speeding up CI with node and docker",
        "description": "<p>Tips for running faster builds with nodejs and docker. This talk mainly outlines lessons learned and optimisations which will hopefully help you get quicker feedback from your CI pipeline and make your deployments run quicker.</p>\n<p>Although I have more experience in the back end side of things, I strive to be a full stack developer. I like working on well tested codebases with a well oiled CI pipeline</p>\n",
        "milestone": "May 24th 2017",
        "img": "https://avatars2.githubusercontent.com/u/771001?v=3",
        "handle": "willm",
        "name": "Will Munn"
    }
]