[
    {
        "apiSpeakerUrl": "https://api.github.com/users/alexjeffburke",
        "speakerUrl": "https://github.com/alexjeffburke",
        "title": "Declaratively mocking HTTP",
        "description": "<p>I am a co-maintainer and the second largest contributor to an open source library named <a href=\"https://github.com/unexpectedjs/unexpected-mitm\">unexpected-mitm</a>. This is a plugin for <a href=\"http://unexpected.js.org\">Unexpected</a>, an extensible assertion tooklit, which enables HTTP mocking using declarative descriptions written in plain JavaScript. Unexpected itself is an open project is supported by a small but growing community. MY goal would be to give a basic introduction to Unexpected assertion syntax, some elements of it&#39;s extension API and combine those with an introduction to the functionality in unexptected-mitm.&#13;&#10;&#13;&#10;My name is Alex J Burke, I currently work as the Lead Platform Developer at a small company in London. I have worked on node the node platform building web application backends and associated software from version 0.6 onwards. I&#39;ve a Computer Science degree from King&#39;s College London and lived for three years in Copenhagen where for a time I worked for a medium size web hosting firm. My handle around the internet is alexjeffburke.</p>\n",
        "milestone": "May 25th 2016",
        "img": "https://avatars.githubusercontent.com/u/721814?v=3",
        "handle": "alexjeffburke",
        "name": "Alex J Burke"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/theninj4",
        "speakerUrl": "https://github.com/theninj4",
        "title": "A Day in the Life of a NodeJS Developer",
        "description": "<p>I&#39;d like to share two stories about bugs encountered during the day-to-day use of NodeJS. The first story is about a bug that plagued 3x developers in the office, the second story is about a major bug in production. These bugs are fat juicy and obscure, relating to non-obvious behaviour in the NodeJS core. I&#39;ll be presenting both stories as a timeline of their discovery through mitigation, understanding and resolution.</p>\n",
        "milestone": "May 25th 2016",
        "img": "https://avatars.githubusercontent.com/u/3055120?v=3",
        "handle": "theninj4",
        "name": "Oliver Rumbelow"
    },
    {
        "apiSpeakerUrl": "https://api.github.com/users/srounce",
        "speakerUrl": "https://github.com/srounce",
        "title": "Debugging Node.JS",
        "description": "",
        "milestone": "May 25th 2016",
        "img": "https://avatars.githubusercontent.com/u/60792?v=3",
        "handle": "srounce",
        "name": "Samuel Rounce"
    }
]